[	{
        "name": "Open data avec Neo4j : de l'idée au déploiement",
        "date": "2017-11-02T18:30:00",
        "place": "ISTIC, Rennes",
        "meetup": "",
        "image": "images/events/neo4j_logo_globe.png",
        "resume": "Cette présentation vous guidera étape par étape de l'idée du produit jusqu'à son déploiement en production.<br>La présentation prendra la forme d'un dialogue client - consultant.<br>Ce jeu de rôles sera l'occasion d'aborder la modélisation d'un domaine concret en termes de graphe, le langage de requêtage Cypher ainsi que des librairies utiles quand on développe une application avec Neo4j.",
        "speakersId": [51,52]
    },{
        "name": "Tu modules ?",
        "date": "2017-10-05T18:30:00",
        "place": "ISTIC, Rennes",
        "meetup": "243455757",
        "image": "images/events/jigsaw.jpg",
        "resume": "On a tout dit sur les modules de Java 9, de « ça va jamais marcher », et « de toutes façons personnes n’est d’accord », à « de toute façon c’est pas encore intégré ».<br>Et si on prenait le temps de comprendre pourquoi il y a des modules dans Java 9, à quoi ils servent, ce que cela va changer et quels sont les bénéfices que l’on peut en tirer.",
        "speakersId": [1]
    },{
        "name": "REX pagesjaunes.fr - Les transactions dans une architecture microservices",
        "date": "2017-09-07T18:30:00",
        "place": "ISTIC, Rennes",
        "meetup": "243071499",
        "image": "images/events/micro-services.png",
        "resume": "Comment sécuriser vos transactions sur une architecture distribuée (microservices) sans que cela vous coûte un bras ? (API REST / RabbitMQ / Cassandra).<br> Je vous propose un retour d'expérience sur la mise en place d'une solution chez PagesJaunes.fr.<br> Chacun a conscience que les transactions doivent être bien gérées pour avoir un système performant et garantissant l’intégrité des données notamment. <br> Venez découvrir comment nous avons mis en place une architecture distribuée basée sur l’asynchronisme et de la reprise de données automatique.",
        "speakersId": [50]
    },{
        "name": "Un peu GOR l'exécution de votre outil de load test préféré!",
        "date": "2017-06-29T18:30:00",
        "place": "ISTIC, Rennes",
        "meetup": "240916754",
        "image": "images/events/goreplay_white.png",
        "resume": "Vous avez maudit JMeter / Gatling /… lors de l'écriture de scénario de performance pour votre site préféré : venez voir comment faire crever ces outils à petit feu au profit de GoReplay.<br>GoReplay est l’outil le plus simple et le plus sûr pour tester votre application en utilisant le trafic réel, avant de la mettre en production, sur votre plateforme de staging.<br>En plus de la présentation de l’outil, vous allez voir pourquoi au sein de PagesJaunes.fr, l’usage de GoReplay a été faite, ainsi que l’architecture mise en place pour répondre à notre besoin de validation.",
        "speakersId": [49]
    },{
        "name": "Découvrons et expérimentons RxJava2 ensemble",
        "date": "2017-05-30T18:30:00",
        "place": "ISTIC, Rennes",
        "meetup": "240038901",
        "image": "images/events/rxjava2.png",
        "resume": "Les concepts associés à la programmation réactive apportés par les Reactive Extensions ne sont pas toujours aisés à comprendre. L'idée de cette session est de présenter RxJava2 et son API à l'aide de plusieurs exemples codés en live.<br>L'objectif est aussi de rendre cette session interactive pour modifier le code et expérimenter l'API RxJava en fonction des questions/remarques de l'ensemble des participants.<br>Cet aspect collectif devrait nous permettre de nous enrichir mutuellement et de repartir avec plein d'idées !",
        "speakersId": [9]
    },
	{
        "name": "A la fin de la soirée vous allez vous la jouer en programmation fonctionnelle",
        "date": "2017-03-21T18:30:00",
        "place": "ISTIC, Rennes",
		"meetup": "237562670",
        "image": "images/events/functionnalProgramming.jpg",
        "resume": "“ aka j’me la p… en monades “<br/><br/>J’ai longtemps trollé les “fonctionnalistes du code” (⚠ je fais un abus de langage) … les Scalafistes quoi! (mais pas que) parce que je trouvais leurs explications compliquées. Demande à un gars qui fait du Haskell de t’expliquer ce que c’est qu’une monade ou un functor … Par contre c’est super dur de troller longtemps quand tu n’as pas compris et que en plus tu utilises un langage non typé 😜. Donc j’ai décidé de m’y mettre (en fait quand tu es 3 semaines aux 🇺🇸, que tu parles pas 🇬🇧 … ça te laisse du temps le soir à l’hôtel) et de comprendre … Et 🕺 j’ai compris ❗️ (bon pas tout mais quand même 2,3 trucs) et en fait c’est juste génial ✨ … me suis même mis à faire du Scala (mais si quelqu’un le répète je le 🔪)<br/>Mais je préfère quand même le JavaScript, donc je vais vous expliquer ce que j’ai compris (Functor, Monad, Either, Maybe, Validation … on parlera même de Kebab) mais après vous pourrez l’adapter à votre langage préféré. Je me ferais aussi aider de la librairie MonetJS pour les exemples (mais on verra aussi que vous pouvez faire votre propre lib)<br/>Vous ne serez peut être pas tous d’accord avec mes définitions (surtout les puristes), mais je vous expliquerez mon cheminement et ce que je pense justement des “fonctionnalistes du code” (❤️ hein! mais trolls quand même)",
        "speakersId": [48]
    },
	{
        "name": "A practical RxJava example with Ratpack and Couchbase",
        "date": "2017-02-02T18:30:00",
        "place": "ISTIC, Rennes",
		"meetup": "237092615",
        "image": "images/events/RatpackRxJavaCouchbase.png",
        "resume": "RxJava seems to be this awesome thing that every cool kids start using. But when you read about it, half of the time it’s hard to make anything out of it. Sure the isolated examples look nice but it’s always hard to put this in perspective with a real app.<br/>In this talk I’ll go through an application made to store, index and search files. We’ll see the benefit brought by using RxJava , Ratpack and Couchbase together. Nothing too complicated or advanced, just something pragmatic.<br/>This talk is for you if you want to discover RxJava through a pragmatic example. It’s a beginner talk.",
        "speakersId": [47]
    },
    {
        "name": "Programmation Reactive",
        "date": "2017-01-12T18:30:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/lesfurets.jpg",
        "eventbrite": "30608278184",
        "meetup": "236432755",
        "resume": "Lorsque vous effectuez une recherche d'assurance sur LesFurets.com, nous interrogeons jusqu’à 40 partenaires pour offrir un maximum d'offres à nos clients. Pour collecter ces offres, nous utilisons des patterns à base de locks, threads et files d'attentes en mémoire pour orchestrer des services au sein de la JVM. Bien que matures, ces constructions sont de très bas niveau et sont sujettes à de nombreuses erreurs : il manque des abstractions pour aider à mettre en œuvre des politiques pour l'optimisation des ressources, la résilience et la performance. La programmation réactive propose une approche différente pour aborder ces problèmes de concurrence en permettant aux développeurs de décrire les opérations sur les flux de données. Dans cette présentation, nous comparons différents patterns pour appliquer une programmation réactive sur un composant critique de notre architecture. Nous donnons des exemples de différentes API telles que RxJava2, Reactive Streams (Java 9 Flow) et CompletableFutures pour implémenter une orchestration de services tout en garantissant la qualité de services pour les utilisateurs.",
        "speakersId": [46],
	"links": [
	    {
                "type": "film",
                "url": "https://youtu.be/xyqZIh3xAWo",
                "name": "Vidéo de la session"
            }]
    },
    {
        "name": "DomainModel().stream()",
        "date": "2017-01-12T18:30:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/lesfurets.jpg",
        "eventbrite": "30608278184",
        "meetup": "236432755",
        "resume": "Pour faire du traitement de données, les listes, tableaux et maps sont les structures de données les plus faciles à manipuler. Malheureusement la plupart des applications sont conçues autour d'un modèle métier.<br/>Chez LesFurets.com nous avons résolu ce problème en développant un KVM (Key Value Mapping). Ce framework est utilisé au cœur de l'application et cohabite avec le modèle métier. Grâce au mapping bidirectionnel de notre modèle métier vers un modèle clé-valeur, les manipulations de données deviennent extrêmement simples à réaliser. La mise en place de ce nouveau paradigme a nécessité un important refactoring de l'application et a permis de l'ouvrir à de nombreux outils actuels (Stream Java 8, RxJava, Spark, Cassandra).",
        "speakersId": [45],
	"links": [
	    {
                "type": "film",
                "url": "https://youtu.be/MS5HUrs3PrQ",
                "name": "Vidéo de la session"
            }
	]
    },
    {
        "name": "Kodo Kojo",
        "date": "2016-12-01T18:30:00",
        "place": "ISTIC, Rennes",
		"eventbrite": "29458972580",
        "image": "images/events/picto-kk-black.png",
        "resume": " Kodo Kojo (https://kodokojo.io), un concentré de bonnes pratiques, pour avoir une usine logicielle scalable et maintenable en trois clics. Kodo Kojo se compose notamment d'un front et d'un backend. Nous vous proposons de vous présenter comment nous avons utiliser Docker dans notre workflow du test au déploiement , que ce soit pour le backend, mais aussi le frontend.",
        "speakersId": [43, 44]
    },
	{
        "name": "Démystifier ElasticSearch",
        "date": "2016-11-03T18:30:00",
        "place": "ISTIC, Rennes",
		"eventbrite": "28387060462",
        "image": "images/events/icon-elasticsearch.png",
        "resume": "ElasticSearch est une solution de moteur de recherche utilisée par beaucoup, comprise par peu. Surcouche de l'inévitable Apache Lucene, ElasticSearch en efface la complexité pour y ajouter des interfaces \"user-friendly\". ElasticSearch est une solution Out-of-the-box étonnante, s'adaptant à l'applicatif et aux besoins sans action de l'utilisateur. Force ou faiblesse ?<br/>Comprendre ce qu'il se passe sous le capot est essentiel pour réaliser des applications performantes et pertinentes. Analyse de texte, types de recherche et clusterisation. Autant d'outils qui méritent d'être appréhendés et compris. ElasticSearch est une brique importante de la stack ELK (ElasticSearch, Logstash, Kibana). Comprendre ce que l'on indexe dans notre moteur et comment nous l'interrogeons est nécessaire pour une restitution pertinente dans Kibana.",
        "speakersId": [42]
    },
	{
        "name": "Des builds incroyablement rapides avec Gradle 3",
        "date": "2016-10-04T18:30:00",
        "place": "ISTIC, Rennes",
		"eventbrite": "27675000672",
        "image": "images/events/gradlephant.png",
        "resume": "Personne n’aime les builds lentes. Combien de fois par jour compilez-vous votre application ? Combien de fois cliquez vous le bouton « run » dans votre IDE ? Combien de fois avez-vous maudit Maven, SBT, Ant, Grunt (et peut-être même Gradle ?) pour leur lenteur désespérante ? Peut-être même certains d’entre vous lancent systématiquement un `clean`, comme réflexe conditionné à un outil de build cassé ?<br/>Avec Gradle, on vise la _build happiness_ : il n’y a aucune raison de ne pas attendre les mêmes standards de qualité entre votre développement et votre process de build. Les builds sont importantes, et mêmes cruciales pour la productivité des développeurs. En ce sens, elles se doivent d’être optimisées pour la performance. Gradle offre différents moyens de le faire: builds incrémentales, builds continues, le daemon, le cache de tâches, les build scans, … Nous avons largement travaillé avec Gradle 3 à améliorer significativement les performances, suffisamment pour en faire un game changer.<br/>Venez apprendre comment rendre vos builds significativement plus rapides. Réclamez votre CPU pour coder, pas pour builder!",
        "speakersId": [19],
	"links": [
		    {
                "type": "film",
                "url": "https://youtu.be/TmFP9R4AD-c",
                "name": "Vidéo de la session"
            },
            {
                "type": "picture",
                "url": "https://melix.github.io/breizhjug-fast-builds/",
                "name": "slides"
            }]
    },
	{
        "name": "Lancer un service en 72h, vous acceptez le challenge ?",
        "date": "2016-09-08T18:30:00",
        "place": "ISTIC, Rennes",
		"eventbrite": "27327180332",
        "image": "images/events/findgas.jpg",
        "resume": "Mai 2016, les grèves en France bloquent les dépôts de carburants et il est difficile de trouver des stations approvisionnées. Afin d'aider les automobilistes, j'ai essayé de proposer une carte interactive permettant à chacun de mettre à jour l'état des stations qu'il croise sur sa route. <br>Dans cette présentation, je vous expliquerai ce que j'ai mis en place, du dev à la prod, en 72h pour lancer le service. J'y parlerai entre autre Elasticsearch, Spring Boot, Leaflet, Nginx, Let's Encrypt, Puppet mais aussi de ce qu'il faut éviter pour réussir le challenge.",
        "speakersId": [41],
	"links": [
	    {
                "type": "picture",
                "url": "https://alex.thomazo.info/wp-content/uploads/2016/09/outrouverdelessence.pdf",
                "name": "slides"
            }]
    },
    {
        "name": "DDD, P&A, ES, CQRS, ETC",
        "date": "2016-06-02T18:30:00",
        "place": "ISTIC ,Rennes",
        "eventbrite": "25533732080",
        "image": "https://zombiecodekill.files.wordpress.com/2015/09/ddd.jpg",
        "resume": "Parce que nous sommes tous des « fashion victims », parce que vous savez déjà que vous ne saurez pas résister aux sirènes des micro-services, parce vous peinez déjà à justifier l'approche « full reactive » dont vous rêvez pour ce projet qui doit démarrer, nous vous proposons de prendre un peu de recul et de discuter, pour une fois, d'architecture logicielle (et de moissonner au passage quelques nouvelles munitions pour votre prochaine « buzzword battle »).\nLe « Domain-Driven Design » est un cadre conceptuel pour le développement de logiciels qui met l'accent sur l'expression directe des concepts du métier sous forme de code, dans le but de diminuer la friction entre experts métiers et informaticiens.\nL'architecture « Ports And Adapters » est une démarche de structuration du code qui vise à isoler la logique métier des détails techniques de son implémentation.\n« Event Sourcing » désigne un principe d'architecture, décrit par Martin Fowler, qui met au centre du monde les événements transformant l'état d'un système. L'état n'est alors rien d'autre que la suite des événements l'ayant produit à partir d'un état initial connu et précisément défini.\nLe principe de « Command Query Responsibility Separation » ou CQRS est un prolongement naturel de l'Event Sourcing où l'on introduit une séparation complète des schémas de données en écriture et en lecture.\nCette présentation est un retour sur nos expériences dans la mise en œuvre de systèmes logiciels basés sur ces démarches de conception et d'architecture. Nous voulons montrer quels sont les principes de ces architectures, quels en sont les avantages tant techniques que métiers dans des cas d'utilisation concrets et comment les mettre en œuvre quels que soient les environnements techniques.",
        "speakersId": [39,40],
        "links": []
    }, {
        "name": "Hackathon: viens coder le CFP du futur",
        "date": "2016-05-03T18:30:00",
        "place": "Le Loft, 3 Rue de Robien Rennes http://www.coworkinrennes.com/",
        "eventbrite": "24342262362",
        "image": "http://www.leecountybusiness.com/wp-content/uploads/2015/04/hackathon.png",
        "resume": "Après le succès du BreizhCamp, l'équipe vous propose de participer à un effort collectif pour faire de notre outils de call-for-papers un service en ligne multi-conférence, communautaire et gratuit. \n\nLe code est dispo sur https://github.com/breizhcamp/callForPaper pour vous faire une idée du bouzin. Pas mal de choses possible à faire :\n  * reprise du code qui n'est pas forcément nickel, un regard externe est le bienvenu\n  * conversion des accès base pour utiliser un 'tenantId'\n  * reprise de l'UI qui est ... euh ... qui a le mérite d'exister\ncréation d'une UI transverse multi-conférences\n  * infra - hébergement, certificats let's encrypt, monitoring, etc\n  * distribuer les bières\n\nTout le monde est le bienvenu !",
        "speakersId": [8],
        "links": []
    }, {
        "name": "Vert.x - Sprechen vous reactive fanta'stico ?",
        "date": "2016-03-03T18:30:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "21562242247",
        "image": "images/events/vertx.png",
        "resume": "Vous devez bâtir une application qui passe à l’échelle, à base de micro-services ou plus classique, tolérante aux pannes, mais vous ne savez pas par ou commencer ? La seule chose dont vous avez besoin est un fichier jar et d’une machine virtuelle java.<br/>Vert.x 3 est une librairie pour créer des systèmes réactifs s’exécutant sur une machine virtuelle Java. Vert.x 3 offre une nouvelle manière d’implémenter des applications concurrentes,scalables et tolérantes aux fautes. Avec vert.x 3 vous pouvez développer des applications « micro-services » distribuées en Java, mais aussi en JavaScript, Groovy, Ruby et Ceylon.  Vert.x 3 permet également d’intégrer des applications \"non-vert.x\" tel que node.js, .NET ou C. <br/>Cette présentation introduit les concepts clés de Vert.x and comment vous pouvez utiliser Vert.x dans votre prochain projet. Cette session explique les systèmes réactifs, la programmation réactive (attention c’est pas la meme chose), comment le modèle de programmation asynchrone proposé par Vert.x vous permet de construire facilement des applications concurrentes et pourquoi c’est fait ainsi. Nous verrons également le passage a l’échelle, la tolérance aux pannes, les perfs, le monitoring et les composants clés de l’éco-système Vert.x…",
        "speakersId": [38],
        "links": []
    },    {
        "name": "Go pour les développeurs Java",
        "date": "2016-02-02T18:30:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "20997590358",
        "image": "images/events/golang.png",
        "resume": "Go, vous en avez sans doute entendu parler. Mais avez-vous consacrer un peu de temps de votre veille technologique dessus?<br/>Si la réponse est non alors cette conférence vous interessera. Langage, Concurrence, Composition, Réflection, Tools, Vendoring, nous ferons un tour d'horizon de tout ce qui compose ce langage en faisant des parrallèles au langage Java. L'objectif de cette conférence sera de vous montrer la philisophie qui se retrouve dans le langage et un peu plus encore.",
        "speakersId": [37],
        "links": []
    },{
        "name": "Big Data pour les Javaistes et le reste d’entre nous!",
        "date": "2016-01-12T18:30:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "20140455645",
        "image": "images/events/big-data.jpg",
        "resume": "Le Big Data, c’est pour nombre d’entre vous c’est une pile de buzz words sur des slides. Pourtant le big data c’est en place chez les startups depuis longtemps et cela fonctionnait même avant que Spark envahisse les sujets de conférences.<br/>Pendant une heure, on fera un tour d’horizon des différentes technologies (pas forcément à la mode) qui vous permettront de profiter des avantages des outils du Big Data.<br/>Pour chaque technologie, on verra les points principaux et surtout un exemple avec du code. Au programme : hdfs, impala, spark, sqoop, R etc... ",
        "speakersId": [36],
        "links": []
    },{
        "name": "Spring Boot in Love",
        "date": "2015-12-10T18:30:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "19634571532",
        "image": "images/events/springboot.png",
        "resume": "Depuis plusieurs années, l'écosystème Spring était devenu lourd : trop de librairies, trop Java EE…​ Spring Boot lui a rendu sa simplicité d’origine que ce soit pour injecter des dépendances, développer une API, intégrer des middlewares ou configurer son application pour le cloud. Venez faire le tour du projet qui a permis que Spring soit de nouveau aujourd’hui une évidence.",
        "speakersId": [35],
        "links": []
    },{
        "name": "Java 8 eXperiments",
        "date": "2015-10-29T19:00:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "19182397066",
        "image": "images/events/lab-experiments.jpg",
        "resume": "Dans cette présentation, je vous propose de découvrir ensemble ce qu’il est vraiment possible d’exprimer avec Java 8 et que peu ont testé. Est-il possible de limiter le nombre de sous-classes pour une classe ? Si on peut désormais mettre un comportement dans une interface, peut-on y mettre un état ? Live coding à l’appui, voici certaines des questions auxquelles nous allons essayer de répondre ou qu’on ne devrait jamais aborder.",
        "speakersId": [34],
        "links": []
    },{
        "name": "GWT n'est pas mort !",
        "date": "2015-10-08T18:00:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "18758746917",
        "image": "http://tabithalevin.com/wp-content/uploads/2012/07/COMPUTER-ZOMBIE-VECTOR.jpg",
        "resume": "Un temps annoncé en perte de vitesse, GWT amorce en 2015 un retour en force conforté par une nouvelle organisation et de profondes modifications de l'environnement de développement. Les outils les plus complexes de Google (Google SpreadSheet, Google Inbox, ....) ont été portés en GWT. Le support de Java 8, des lambdas expression du Super Dev Mode et des Web Component en font la technologie de choix pour le développeur Java. Cette session résume les nouveautés de la dernière version et dessine la roadmap des années à venir. Le tout illustré d'exemples de code et de démonstrations.",
        "speakersId": [33],
        "links": []
    },{
        "name": "Continuous Delivery avec Jenkins et Docker",
        "date": "2015-09-10T18:00:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "18224179010",
        "image": "images/events/docker-jenkins.png",
        "resume": "le 'Continuous Delivery' est un sacré buzz word, et 'Docker' encore plus, mais les blog que j'ai pu lire sur sujet ne proposent qu'un pipelines naif et minimaliste : compile, test, push docker image, et voilà.\nEn 2015 Jenkins adresse clairement plus que de l'Integration Continue, et avec le support récent du workflow plugin nous pouvons orchestrer avec un DSL des pipelines de grande complexité. L'integration avec Docker lui donne encore plus de puissance.\nPendant cette session, je vais construire un pipeline de CD from scratch pour montrer l'utilisation du workflow et sa flexibilité, ainsi que le support de Docker.",
        "speakersId": [8,15],
        "links": []
    },{
        "name": "Design Patterns Reloaded",
        "date": "2015-04-28T18:00:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "16544195133",
        "image": "http://static.guim.co.uk/sys-images/Film/Pix/pictures/2008/06/06/matrixreloaded460.jpg",
        "resume": "Design Pattern par le Gang Of Four à plus de 20 ans, en année chat ou en informatique, c'est pas très loin d'une éternité. Je profilte de la sortie de Java 8, pour revisiter les principaux design-pattern et leurs faire un petit toilettage à la sauce Lambda.",
        "speakersId": [1],
        "links": []
    },
    {
        "name": "HTTP/2 : why upgrading the web ?",
        "date": "2015-04-02T18:30:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "15495594741",
        "image": "images/events/http2.jpeg",
        "resume": "HTTP is the protocol who rules the WEB. 20 years old, the version 2, major upgrade is now cooked and nearly ready to be used by real peoples. So, how new the new HTTP version is? What is the new features added to the protocol? Is it great to used? Does it will be used or be the next ipv6 like giant internet migration? Overview of HTTP2 and why it's great.",
        "speakersId": [32],
        "links": [{
            "type": "picture",
            "url": "http://www.slideshare.net/divarvel/http2-47748252",
            "name": "slides"

        },{
            "type": "film",
            "url": "https://www.youtube.com/watch?v=ZcrWSeTeVUA",
            "name": "Vidéo"
        }]


    },
    {
        "name": "WebComponents",
        "date": "2015-03-12T18:30:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "15495659936",
        "image": "images/events/webcomponents.jpeg",
        "resume": "Des concepts comme l’encapsulation, la réutilisation de composants, le data-binding ou le templating sont maintenant monnaie courante dans la plupart de frameworks web… mais chacun le fait à sa façon ! Et c’est là que les Web Components débarquent. Un nouveau standard en cours d’élaboration au W3C, qui va permettre d’avoir une approche par composants au développement web.\nDans cette présentation Horacio parlera de ce standard en construction et des implémentations actuelles, du projet Polymer de Google, des X-Tags de Mozilla et de comment, avec AngularJS, on peut déjà avoir un bon aperçu de ce que nous attend.",
        "speakersId": [31],
        "links": [{
            "type": "film",
            "url": "http://youtu.be/7ObA5u6SxiA",
            "name": "Partie 1 : WebComponents"
        }, {
            "type": "film",
            "url": "http://youtu.be/cN7ugOEteSo",
            "name": "Partie 2 : Polymer"
        }, {
            "type": "picture",
            "url": "https://www.dropbox.com/s/cj0und04kpfp9mz/Web%20Components%20avec%20Polymer.pdf?dl=0",
            "name": "slides"
        }]
    },
    {
        "name": "Cassandra",
        "date": "2015-02-05T18:30:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "15267938816",
        "image": "images/events/cassandra.jpeg",
        "resume": "Le 'Cassandra Tour' est dédié à la présentation de Cassandra, la base NoSQL orientée colonnes derrière les grandes entreprises comme Netflix, Sony Entertainment, Apple. Les présentations seront assurées par DuyHai DOAN, évangéliste technique Cassandra chez Datastax.\nLa présentation se découpe en deux parties.\n\n* la première partie est une présentation générale de Cassandra, de son modèle de données et les bonnes pratiques de modélisation: comment passer du monde SQL au monde NoSQL.\n* La deuxième partie présentera les outils pour aider le développeur Java à travailler efficacement avec Cassandra.",
        "speakersId": [28,29],
        "links": [{
            "type": "film",
            "url": "http://youtu.be/Z23w98tnXXc",
            "name": "Vidéo de la session"
        },{
            "type": "picture",
            "url": "http://fr.slideshare.net/doanduyhai/cassandra-introduction-breizhjug",
            "name": "Slides"
        },{
            "type": "picture",
            "url": "http://fr.slideshare.net/doanduyhai/killrchat-data-modeling",
            "name": "KillrChat"
        },{
            "type": "barcode",
            "url": "https://github.com/doanduyhai/killrchat",
            "name": "le code de KillrChat"

        }]
    },
    {
        "name": "JHipster",
        "date": "2015-01-08T18:30:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "14909928999",
        "image": "images/events/logo-jhipster-drink-coffee.png",
        "resume": "JHipster est un générateur de code permettant de créer une application Spring Boot + AngularJS en quelques minutes. Cette présentation couvrira rapidement les technologies utilisées par JHipster (Spring Boot, AngularJS, Bower, Grunt, etc...), et se focalisera sur une session de 'live coding' où nous développerons une application métier, la modifierons, et la déploierons dans le cloud.",
        "speakersId": [16],
        "links": [{
            "type": "film",
            "url": "http://youtu.be/LgYI6nloMOw",
            "name": "Vidéo de la session"
        }]
    },{
        "name": "Android Wear : Ceci n'est pas une montre !",
        "date": "2014-12-11T18:30:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "14694631037",
        "image": "images/events/android-watch.png",
        "resume": "Le but de cette présentation est de bien cerner la plateforme et l'usage approprié. On parlera donc des principes en terme d'UX et d'utilisation de l'API.",
        "speakersId": [27],
        "links": [{
            "type": "film",
            "url": "http://youtu.be/Ny3Dom2ggoA",
            "name": "Vidéo de la session"
        },{
            "type": "picture",
            "url": "https://github.com/BreizhJUG/www/raw/gh-pages/slides/AndroidWear.pdf",
            "name": "Slides"
        }]

    },{
        "name": "Big Data",
        "date": "2014-11-06T18:30:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "14049367035",
        "image": "images/events/elephant.jpg",
        "resume": "Hadoop, Mapreduce, Yarn, Pig et tant d’autres avec surtout le fameux “Big Data” qu’il est de bon ton de placer en soirée pour faire bonne impression :)\nBref. Revenons au commencement : Comment et pourquoi Hadoop est né ? Quelles sont les bases techniques ? Nous ferons un tour d’horizon de Hadoop, son histoire, son intérêt et ses principes, sur le désormais célèbre map-reduce et la parallélisation massive, sur ses enjeux. On verra ensuite comment la plateforme a évolué ces dernières années, gagnant en flexibilité et possibilités.",
        "speakersId": [26],
        "links": [{
            "type": "film",
            "url": "http://youtu.be/35JN755MbHo",
            "name": "Vidéo de la session"
        },{
            "type": "picture",
            "url": "http://bit.ly/13VcLSH",
            "name": "Slides"
        }]
    },{
        "name": "OpenStack 101",
        "date": "2014-10-09T18:30:00+02:00",
        "place": "Supinfo, Rennes",
        "eventbrite": "13380512473",
        "image": "images/events/openstack.png",
        "resume": "Vous avez déjà entendu parler d'OpenStack ? Vous connaissez de nom mais ce n'est pas très clair ? OpenStack, c'est LA solution Open Source d'infrastructure Cloud. Elle sert de fondation à des grands clouds publics, mais peut aussi être utilisée pour créer son propre cloud privé. Que vous soyez développeur ou administrateur système, venez découvrir ce qu'offre OpenStack et comment il fonctionne.\n\nAttention, pour une fois nous serons hébergés dans les locaux de Supinfo (ex 'Thomson')",
        "speakersId": [15],
        "links": [{
            "type" :"picture",
            "url": "https://github.com/ydubreuil/breizhjug-openstack/raw/master/Openstack.odp",
            "name": "slides"
        }]
    },{
        "name": "MODERN WEB WITH JAVA",
        "date": "2014-09-11T18:00:00+02:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "12847313661",
        "image": "images/events/code-story.png",
        "resume": "Venez participer à cet atelier de 2 heures. L'objectif est simple : apprendre à développer une application web moderne en Java. Rapidement, de manière pragmatique et en toute confiance.\nAvec l'assistance et les démos live de David Gageot et Jean-Laurent de Morlhon.\nAu menu : du Java 8, un poil d'Angular, un soupçon de CoffeeScript, du MongoDB, du pair-programming, des tests IHM, des hotkeys de malade, des plugins de fou et un cycle de développement ultra rapide. Oui vous ne rêvez pas on parle bien de Java.\nLundi, au boulot, vous ne verrez plus votre projet java de la même manière.\n\n Cet atelier est limité à 30 places, et fonctionne en binômes avec votre propre matériel.",
        "speakersId": [24,25],
        "links": [{
                "type":"barcode",
                "url":"https://github.com/dgageot/lab",
                "name":"code du lab"
                }]
    },{
        "name": "ElasticSearch",
        "date": "2014-06-05T18:00:00+02:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "11760850019",
        "image": "http://www.duchess-france.org/wp-content/uploads/2012/09/elasticsearch.png",
        "resume": "Vous utilisez encore des requêtes SQL pour faire des recherches ? Vos utilisateurs vous reprochent de ne pas pouvoir chercher sur toutes les rubriques ? Votre temps de réponse moyen est supérieur à la demi-seconde avec seulement quelques millions de documents ? Il vous faut 3 jours pour produire des statistiques sur vos données ? Vous rêvez d’offrir une recherche 'à la google sur les données de votre SI ?\n\nNe cherchez plus ! Cette conférence est faite pour vous.\nDavid présentera au cours de la soirée pourquoi et comment il est passé de la recherche SQL à Elasticsearch en détaillant les apports de ce moteur par rapport à une solution pure Lucene :\n  - Pourquoi Elasticsearch ?\n  - L'indexation\n  - La recherche\n  - Les agrégations et le principe de navigation par facettes\n  - La scalabilité horizontale\n  - L'analyse et le mapping\n  - La percolation\n  - La communauté",
        "speakersId": [23],
        "links": []
    },{
        "name": "Les Patterns de Cache",
        "date": "2014-04-03T18:00:00+02:00",
        "place": "ISTIC, Rennes",
        "eventbrite": "11030196615",
        "image": "images/events/Cache.jpg",
        "resume": "Comment diminuer le temps de traitement d’un batch ? Le temps d’exécution d'une requête ? Le cache est un des outils du développeur pour résoudre ses problématiques quotidiennes et les concepts qui gravitent autour sont nombreux. Si les mots Cache Aside, Write-Behind, Read-Through ne vous sont pas familiers, cela fait pourtant parti des architectures qu’il est facile à mettre en place et qui dans certains contextes peuvent diminuer de manière drastique la durée d’un batch ou d’une requête. Nous aborderons également les différents moyens de scaler horizontalement et verticalement le cache (réplication, miroir, partitionnement) en nous appuyant sur différentes librairies existantes (GemFire, Coherence, Terracotta, Ehcache, Infinispan, Hazelcast) mais également NoSQL et plus généralement les In Memory Data Grid (IMDG)",
        "speakersId": [22],
        "links": [{
                "type": "film",
                "url": "http://youtu.be/m4ESPifc6Zg",
                "name": "Vidéo de la session"
        }]
    },{
        "name": "Soyons RESTful avec RESTX",
        "date": "2014-02-27T18:00:00+01:00",
        "place": "ISTIC, Rennes",
        "eventbrite" : "10709112243",
        "image": "images/events/RestX.png",
        "resume": "Avec l'essor des frameworks comme Angular, les développeurs Java que nous sommes se laissent de plus en plus séduire par le JS pour développer des IHM.\n\nMais pour le serveur, le monde Java garde quand même l'avantage avec son typage, sa maintenabilité et ses performances.\nDans cette mouvance, on voit de nouveaux outils apparaître pour développer des micro-services REST de manière productive et efficace.\nAu cours de cette session, je vous propose quelques révisions sur les principes des services REST, pour voir ensuite au travers de nombreuses démos comment RESTX, un outil open source, innovant et made in France peut vous aider à construire, documenter et tester l'API REST idéale pour vos applications web de demain.\n\nPour plus d'infos sur RESTX, jetez un oeil à [restx.io](http://restx.io/)",
        "speakersId": [6],
        "links": [{
                "type": "picture",
                "url": "http://zenika.github.io/Presentations/20140227_BreizhJUG_RESTX",
                "name": "slides"
        }]
    },{
        "name": "La révolution Docker",
        "date": "2014-02-06T18:00:00+01:00",
        "place": "ISTIC, Rennes",
        "eventbrite" : "10347332149",
        "image": "images/events/docker.png",
        "resume": "En très peu de temps, Docker a su s'imposer comme un standard __de facto__ dans le monde du Cloud (et pas seulement), ne laissant aucun fournisseur impassible. A mi-chemin entre IaaS et PaaS, Docker brouille les cartes et ouvre de nouvelles opportunités. \n Au cours de ce talk, nous vous présenterons ce qu'est techniquement Docker, son impact sur nos pratiques de déploiment et d'exploitation et comment vous pouvez le mettre à profit pour vos propres usages.",
        "speakersId": [8],
        "links": []
    },{
        "name": "BigData",
        "date": "2014-01-09T18:30:00+01:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/big-data.jpg",
        "resume": "Soirée Big Data. \n * Les Paradoxes du Big Data \n * Overview d’Hadoop et de ses Usages \n * Le Machine Learning : qu’est-ce que c’est et comment l’utiliser \n * Un cas pratique de projet Data.",
        "speakersId": [21],
        "links": [
            {
                "type": "film",
                "url": "http://youtu.be/Wl8T2b7q39I",
                "name": "Vidéo de la session"
            },
            {
                "type": "picture",
                "url": "http://fr.slideshare.net/Dataiku/dataiku-pages-jaunes-breizhjug-presentation-complete-janvier-2014",
                "name": "slides"
            }]
    },
    {
        "name": "Build Battle",
        "date": "2013-12-05T18:00:00+01:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/battle.jpg",
        "resume": "'Maven télécharge l'internet', tout le monde l'a entendu au moins une fois. Ce n'est pas le seul reproche qu'on lui fait d'ailleurs. Pour cette session, nous comparerons Maven aux autres outils de builds, avec un focus tout particulier sur Gradle.\n Nous verrons aussi comment se comportent les autres langages de programmation, et comment certains tirent des leçons des errements de Java.",
        "speakersId": [19,8],
        "links": [
            {
                "type": "film",
                "url": "http://youtu.be/hVn3C2YHVD4",
                "name": "Vidéo de la session"
            },
            {
                "type": "barcode",
                "url": "https://github.com/melix/breizhjug-dec-13",
                "name": "Repo du talk"
            },
            {
                "type": "barcode",
                "url": "http://www.gradle.org/documentation",
                "name": "Documentation de Gradle"
            },
            {
                "type": "barcode",
                "url": "http://tools.android.com/tech-docs/new-build-system/user-guide",
                "name": "Plugin Android"
            },
            {
                "type": "film",
                "url": "http://www.youtube.com/watch?v=5a91dBLX8Qc",
                "name": "Must-see, introduction à Gradle par Hans Dockter"
            },
            {
                "type": "picture",
                "url": "http://melix.github.io/breizhjug-dec-13/",
                "name": "slides"
            }]
    },
    {
        "name": "AngularJS",
        "date": "2013-11-07T18:00:00+01:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/angularjs.jpg",
        "resume": "Oubliez JSF, Flex, GWT, Backbone et jQuery(1) : l’avenir des applications web passe par AngularJS. Ce framework de Google est le premier à rendre la plate-forme HTML/JavaScript/CSS directement efficace pour le développement d’applications. Plus besoin de générer les pages web côté serveur, d’avoir un plugin Flash, de générer le JavaScript depuis un autre langage, ou de se perdre dans les manipulations du DOM. Après 15 ans d’errements et de solutions artificielles frôlant parfois la limite de l’absurdité, on peut enfin développer la couche de présentation des applications web de façon naturelle, c’est-à-dire directement côté client et nativement en JavaScript, et avec le même niveau de qualité et de productivité que sur les développements côté serveur. Au programme de ce soir, démonstration des possibilités du framework AngularJS et mise en perspective de son rôle dans l’architecture des applications web modernes. (1) N’oubliez quand même pas complètement jQuery qui vous sera utile pour écrire vos propres composants AngularJS.",
        "speakersId": [12],
        "links": [
            {
                "type": "barcode",
                "url": "https://github.com/tchatel/last-tweets-angularjs",
                "name": "les tweets sur AngularJS"
            },
            {
                "type": "barcode",
                "url": "https://github.com/tchatel/angular-notifications",
                "name": "les notifications"
            },
            {
                "type": "book",
                "url": "http://plnkr.co/edit/gn1jVW?p=preview",
                "name": "la directive Google Maps"
            },
            {
                "type": "picture",
                "url": "https://github.com/tchatel/slides-jug-bretagne",
                "name": "slides"
            }]
    },{
        "name": "Sous le capot de la JVM : Les Lambdas",
        "date": "2013-10-03T18:30:00+02:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/sous-le-capot.jpg",
        "resume": "**Les lambdas** vont être une avancée majeure du JDK 8. Pour nous en parler, nous recevrons Remi FORAX, membre de l’expert group pour le JCP sur les JSR 292 (invokedynamic) et JSR 335 (lamddas). Remi a participé à son implémentation dans le JDK 8, disponible depuis peu en version \"Developper Preview\" (https://jdk8.java.net/download.html). Son regard sur le \"pourquoi\" et le \"comment\" sera donc particulièrement intéressant.",
        "speakersId": [1],
        "links": [
            {
                "type": "film",
                "url": "http://www.youtube.com/watch?v=5VPUbSauVcQ",
                "name": "Vidéo, partie 1"
            },
            {
                "type": "film",
                "url": "http://www.youtube.com/watch?v=muEBh5-sfpU",
                "name": "Vidéo, partie 2"
            },
            {
                "type": "picture",
                "url": "https://www.dropbox.com/s/m6ay4kj3qbgfk7i/Lambda%20from%20the%20trench.pdf",
                "name": "Slides"
            }
            ]
    },{
        "name": "BreizhKids",
        "date": "2013-06-15T16:00:00+02:00",
        "place": "SUPINFO, Rennes",
        "image": "images/events/kids.jpg",
        "resume": "L'informatique et la robotique sont des terrains de jeu fabuleux pour les enfants mais parfois difficile d'accès. Il existe des logiciels ludiques et pédagogiques open source permettant de découvrir les techniques de programmation et commencer à réaliser ses propres programmes facilement.<br/>Les informaticiennes qui animeront l'atelier ont déjà partagé leur expérience avec des jeunes dans le cadre d'événements tels que Programmatoo ou Devoxx4Kids.<br/>Mais... pourquoi donc apprendre la programmation quand on a moins de 14 ans ?<ul><li>Parce qu'on aime jouer</li><li>Parce qu'on veut comprendre ce que nos parents font comme métier !</li><li>Parce qu'un ordinateur ne permet pas que de naviguer sur internet ou jouer à minecraft !</li><li>Parce que c'est tout à fait à notre portée, et pourtant on n'en fait pas à l'école !</li></ul>Le BreizhKids c'est tout ça à la fois : un atelier où les enfants pourront jouer ensemble, accompagnés par les adultes, pour mieux comprendre l'outil informatique en découvrant la programmation avec des outils adaptés à leur âge.Zenika a la gentillesse de nous prêter des PC de formation pour que les bambins puissent découvrir les joies de la programmation, et nous seront gracieusement hébergés par SupInfo - 8, Place du Colombier à Rennes (Quartier Colombier). <br/>Les ateliers débuteront à 15h et seront animés par Audrey Neveu et Claude Falguière. Il est prévu de faire des ateliers en 2 groupes de 10 enfants sur une durée de 2h30 maximum avec un goûter au milieu pour ne pas vous les rendre complètement exténués.",
        "speakersId": [4,5],
        "links": [
            {
                "type": "film",
                "url": "http://www.youtube.com/watch?v=rPCWyFF_bac",
                "name": "Vidéo"
            }
        ]
    },{
        "name": "AngularJS",
        "date": "2013-05-06T18:30:00+02:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/angularjs-mai.jpg",
        "resume": "Pour bien conclure cette année, et avant d'attaquer la préparation du BreizhCamp, notre session de mai sera consacrée à AngularJS, le framework web de nouvelle génération qui réconcilie les développeurs avec JavaScript. Nous recevrons Thierry LAU et Sébastien BROUSSE pour nous présenter les arcanes de ce framework, et nous convaincre que Struts, SpringMVC, Wicket, GWT et consorts font partie de la préhistoire.",
        "speakersId": [2,6]
    },{
        "name": "Retour DevoxxFR",
        "date": "2013-04-11T18:30:00+02:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/DevoxxFR.jpg",
        "resume": "Pour notre prochain événement BreizhJUG, nous vous proposons de faire un retour sur DevoxxFrance, en compagnie des BreizhJuggers qui y étaient présent. Nous parlerons aussi bien du contenu, de l'organisation de cet événement d'exception, et du rôle de speaker fàce à une salle de 800 personnes. A l'occasion de ce JUG, nous recevrons également Yolande Poirier, que vous connaissez peut être plus sous le twitter @java, car elle est \"Outreach Manager\" pour Oracle. Elle nous présentera l'organisation de la communauté Java sous la direction d'Oracle, comment se faire entendre et contribuer.",
        "speakersId": [6, 8, 9, 15]
    },{
        "name": "Avant Première DevoxxFR",
        "date": "2013-03-14T18:30:00+02:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/minitel-h300.jpg",
        "resume": "Pour la session de mars du BreizhJug, nous vous proposons un avant-gout de Devoxx, avec en avant première deux \"tools in action\" que Laurent Huet et Nicolas Deloof présenterons à cette conférence : <ul><li><b>Good Bad and Ugly Maven : a puzzler</b><br/>Maven, de renommée mondiale, est bourré de bugs, de non-sens et d'anti-patterns ... et malgré tout un standard de fait ! Au cours de cette session, nous vous proposons de tester vos connaissance autour de quelques puzzlers, avec explication à la clé et surtout nos conseils pour éviter ces travers sur vos projets.<br/></li><br/><li><b>3615 Cloud </b><br/>Dans cette session, vous allez découvrir comment \"marier l'internet français d'hier avec le Cloud d'aujourd'hui !\". De manière décalée, venez découvrir comment, avec un petit peu de hardware, on peut superviser ses instances du cloud avec un Minitel et une carte Raspberry Pi! Ce bricolage trans-générationnel servira de support pour présenter la programmation sur Raspberry, depuis le niveau hardware jusqu'à notre bonne vielle JVM</li></ul>",
        "speakersId": [8, 9]
    },{
        "name": "Java.NEXT : Lambdas et Jigsaw",
        "date": "2013-02-07T18:00:00+02:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/Java8.jpg",
        "resume": "pour notre session de février, nous allons profiter de la venue de Paul Sandoz, ex spec-Lead de JAX-RS, aujourd'hui software engineer chez Oracle sur Java 8, pour vous proposer une soirée sur l'avenir de Java. Cette soirée se déroulera en deux étapes :<ol><li><b>de 18h00 à 19h00, un atelier sur la mise en oeuvre des lambdas Java 8</b></li>Pré-requis :<ul><li>un ordinateur</li><li>installer le JDK adéquat (http://jdk8.java.net/lambda/)</li><li>disposer d'un IDE compatible avec la programmation lambda (Netbeans ou Idea)</li></ul>L'atelier commencera à 18h00 précise, merci de prendre vos dispositions en conséquence<br/><li><b>de 19h00 à 20h30, une conférence sur la modularisation de la JVM avec le projet JigSaw</b></li>bien que repoussée à Java 9, pour cause de manque de maturité, cette évolution majeure de Java mérite qu'on s'y attarde, et devrait apporter un réel renouveau à la plateforme.</ol>",
        "speakersId": [3]
    },{
        "name": "NoSQL!",
        "date": "2013-01-10T18:30:00+02:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/NoSQL.jpg",
        "resume": "Nous attaquerons cette nouvelle année avec une soirée NoSQL en deux parties :<ul><li><b>MongoDB</b> présenté par Manuel Boillod</li><li><b>CouchBase</b> présenté par Tugdual Grall</li></ul> Profitez de cette nouvelle année pour prendre une bonne résolution : faire la promo du JUG auprès de vos collègues et amener de nouvelle têtes à nos sessions !",
        "speakersId": [10, 11]
    },{
        "name": "Hard",
        "date": "2012-12-06T18:30:00+02:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/hard.jpg",
        "resume": "Changement de registre pour notre prochaine session du BreizhJug : nous allons parler Hard !<br/>Je ne parle évidement pas de faire un BreizhJug en cuir et chaines, mais bien de Hard-Ware, que nous avons parfois tendance à oublier lorsque nous programmons nos patterns sur des architectures hautement abstraites. Aussi, nous vous proposons:<ul><li>la mise en place d'un feu tricolore Jenkins par Eric Hebert</li><li>même sujet, mais en version \"Do It Yourself\" par nicolas de loof</li><li>plus velu, une présentation de BeagleBone pour mettre du code dans le hard</li></ul>",
        "speakersId": [13, 8, 20, 9]
    },{
        "name": "Lombock & Guava",
        "date": "2012-11-05T18:30:00+02:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/lombock.jpg",
        "resume": "Guava est une librairie open source créée et maintenue par les équipes de Google. Inspirée des outils internes du géant, Guava propose de nombreux mécanismes (prog fonctionnelle) pour manipuler les collections, créer des caches customisés, faciliter la gestion de la concurrence et les IOs. De son coté, Lombok est également un projet Open Source. Lombok et Lombok-pg simplifient sensiblement l’écriture de code classique (builders, delegates, etc.) et des nombreuses méthodes purement techniques et indispensables (getters, setters, hashCode, equals, etc.) qui polluent nos objets.<br/>Durant cette présentation, après un rapide constat de la verbosité de nos beans, nous feront un tour d’horizon de Lombok et Guava. Nous verrons comment ils nous aident à écrire du code concis et de qualité.",
        "speakersId": [14]
    },{
        "name": "HTML5, Spring, NoSQL et mobilité",
        "date": "2012-10-08T18:00:00+02:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/tatami.jpg",
        "resume": "Au programme, nous recevons Julien Dubois, qui était déjà passé nous voir il y a quelques temps pour une session sur Spring, et qui revient ici pour un sujet plus large : HTML5, Spring, NoSQL et mobilité <br/>En nous basant sur l'application Tatami https://github.com/ippontech/tatami nous ferons le point sur les dernières technologies permettant de créer des applications Web modernes :<ul><li>HTML5, Backbone.js, JQuery et Twitter Bootstrap</li><li>Spring 3.1</li><li>NoSQL avec Cassandra et ehcache</li><li>La mobilité : application dédiée avec JQuery Mobile vs responsive design avec Backbone.js</li></ul>Nous étudierons les aspects positifs (et négatifs!) de chaque technologie, ainsi que leurs impacts en termes de productivité des développement et de performance de l'application finale. Attention, cette session comporte de vrais morceaux de code à l'intérieur !",
        "speakersId": [16]
    },{
        "name": "Marre de Java",
        "date": "2012-06-04T18:30:00+02:00",
        "place": "ISTIC, Rennes",
        "image": "images/events/ceylon.png",
        "resume": "nous vous proposons de venir découvrir Ceylon, langage développé par RedHat, avec pour objectif d'apporter à Java un langage simple, expressif, concis et structuré de manière homogène. Conçu par Gavin King, a qui on doit déjà Hibernate, ce langage vient sur un terrain déjà bien occupé, aussi cette session sera l'occasion de voir plus clair dans cet écosystème étonnant des langages alternatifs.",
        "speakersId": [17, 18]
    }
]
