[
    {
        "id": 1,
        "name": "Rémi Forax",
        "avatar": "images/speakers/Forax_Remi.jpg",
        "resume": "Maitre de conférence à l'université Paris Est - Marne la Vallée.<br/>Expert pour les JSRs 292 et 335.<br/>Tombé dans le Java quand il était petit."
    },
    {
        "id": 2,
        "name": "Thierry Lau",
        "avatar": "images/speakers/Thierry_Lau.jpg",
        "resume": "Développeur Front End chez [sfΞir], je suis passionné par HTML5, CSS3, JavaScript et plus particulièrement fan d'AngularJS car je suis persuadé qu'il aide à répondre à la problématique suivante : comment développer des applications Web modernes, maintenables de manière la plus simple, rapide et efficace possible ? Pour cela, je suis également intéressé aux outils qui viennent armer les développeurs Web modernes tels que Brunch, Grunt, Yeoman, Bower, Developer tools de Chrome etc ... Je suis également créateur et co-modérateur de la communauté française HTML5 * CSS3 [FR] sur Google + et j'anime également la page Google+ HTML5 * CSS3 - ʕ๏̮๏ʔ, deux endroits où vous pouvez venir partager avec moi la passion des technologies du Web.",
        "twitter": "laut3rry",
        "github": "lauterry",
        "mail": "thierlau@gmail.com"
    },
    {
        "id": 3,
        "name": "Paul Sandoz",
        "avatar": "images/speakers/Paul_Sandoz.jpg",
        "resume": "A reformed RESTerfarian who previously co-led JAX-RS and led the implementation Jersey, who moved up into the clouds with the industrious bees of CloudBees, and then boomeranged back to Oracle and deep down the Java stack to work on OpenJDK Lambda, Java modularity and Project Jigsaw.",
        "twitter": "paulsandoz"
    },
    {
        "id": 4,
        "name": "Audrey Neveu",
        "avatar": "images/speakers/Audrey_Neveu.jpg",
        "resume": "Développeur Java chez Sfeir, ce que j'aime le plus dans ce langage c'est l'incroyable énergie de la communauté qui gravite autour. Ayant découvert les JUGs en même temps que ma vocation de développeur, j'ai souhaité rendre à la communauté un peu de la richesse qu'elle m'avait apporté en y contribuant à mon tour. Après avoir rejoint Duchess France en 2010, j'ai choisi aujourd'hui de m'engager dans Programatoo et Devoxx4Kids, deux iniatives aux travers desquelles j'essaye de transmettre ma passion aux enfants, pour leur faire découvrir ce superbe métier qui est le nôtre.",
        "twitter": "Audrey_Neveu"
    },
    {
        "id": 5,
        "name": "Claude Falguière",
        "avatar": "images/speakers/Claude_Falguiere.jpg",
        "resume": "Claude Falguière est consultante sénior chez Valtech Technology où elle intervient sur des missions d'architecture technique et d'analyse de performance d'applications Java/JEE. Elle est co-fondatrice de Duchess France http://jduchess.org/duchess-france/ et membre de l'équipe du Paris JUG http://parisjug.org. Vous pouvez la retrouver sur son blog http://cfalguiere.wordpress.com/ et sur twitter @cfalguiere.",
        "twitter": "cfalguiere"
    },
    {
        "id": 6,
        "name": "Sébastien Brousse",
        "avatar": "images/speakers/Sebastien_Brousse.jpg",
        "resume": "Sébastien Brousse est consultant chez Zenika Ouest sur les technologies liées aux ESB et aux architectures SOA. Il a exercé son expertise au sein de grands comptes comme le ministère de l'environnement. Défenseur de la qualité logicielle, il oeuvre aussi à promouvoir activement l'intégration continue et l'automatisation des processus de build.",
        "twitter": "seb_brousse"
    },
    {
        "id": 7,
        "name": "Yolande Poirier",
        "avatar": "images/speakers/Yolande_Poirier.jpg",
        "resume": "Yolande Poirier est Community Outreach Manager for Java developers chez Oracle.",
        "twitter": "ypoirier"
    },
    {
        "id": 8,
    	"name": "Nicolas De Loof",
    	"avatar": "images/speakers/Nicolas_DeLoof.jpg",
    	"resume": "'Java Architect' pendant 14 ans dans une grande SSII, Techno-addict et contributeur open-source, J'ai rejoins l'équipe Apache Maven en 2007, développant le plugin GWT, et plus tard la communauté Jenkins. \nProfitant de nombreuses relations dans la communauté Java, je fonde le BreizhJUG en 2008, puis le BreizhCamp.\n\nEn 2011 je quitte le monde du service pour celui du as-a-Service - je rejoins CloudBees sur un project ambitieux : faire tourner Java dans le Cloud, du code source à la production.",
    	"twitter": "ndeloof"
    },
    {
        "id": 9,
        "name": "Laurent Huet",
        "avatar": "images/speakers/Laurent_Huet.jpg",
        "resume": "Après avoir été quelques années spectateur assidu des conférences du BreizhJug, je suis passé du coté obscur de la force en rejoignant la team et en suis le principal animateur depuis septembre 2016. Coté pro, j'ai plus d'une 15aine d'années de société de service au compteur et travaille désormais dans le domaine de la robotique industrielle chez BA Systèmes.",
        "twitter": "lhuet35"
    },
    {
        "id": 10,
        "name": "Manuel Boillod",
        "avatar": "images/speakers/Manuel_Boillod.jpg",
        "resume": "Manuel Boillod est architecte Java chez Zenika Ouest et intervient sur toutes les couches des applications informatiques, de la base de données au développement web, de l'usine logicielle à l'infrastructure. Formateur certifié VMware sur Grails, il dispense également des formations autour des technologies Java telles que Spring, Hibernate, Wicket, ... En tant responsable technique sur plusieurs projets, il a l'habitude d'encadrer des équipes de développement ou d'accompagner les entreprises sur des phases de conseil, d'architecture ou d'avant-vente. Passionné par la technique, il est également JUG Leader à Nantes et anime des conférences techniques autour de Java et du NoSQL.",
        "twitter": "mboillod"
    },
    {
        "id": 11,
        "name": "Tugdual Grall",
        "avatar": "images/speakers/Tugdual_Grall.jpg",
        "resume": "Tugdual « Tug » Grall, est Technical Evangelist chez Couchbase, et un développer passionné. Il travaille actuellement avec les communautés de developpers en Europe pour faciliter l’adoption du NoSQL. Tugdual contribue aux SDKs Java et NodeJS de Couchbase. Avant de rejoindre Couchbase, Tug était le CTP d’eXo la société qui a créé l’outil de développement sur le cloud www.codenvy.com et la pateforme sociale eXo Platform. Auparavant Tugdual a travaillé comme product manager et développeur dans l’équipe Oracle Fusion Middleware sur la plateforme Java EE. Tug a participé a de nombreuses conférences DevoxxFR, FOSDEM, Google I/O, JavaOne et de nombreux meetups/groupes utilisateurs. Tugdual est co-fondateur du NantesJUG qui organise depuis 2008 des réunions mensuelles autour l’écosystème Java. Lorsqu’il a le temps, il maintient un blog http://tugdualgrall.blogspot.com et une application déployée sur Google App Engine http://www.resultri.com. Vous pouvez le suivre sur http://twitter.com/tgrall",
        "twitter": "tgrall"
    },
    {
        "id": 12,
        "name": "Thierry Chatel",
        "avatar": "images/speakers/Thierry-Chatel.jpg",
        "resume": "Thierry est consultant et formateur indépendant, spécialisé dans l’architecture des applications web et sur le framework AngularJS. Il découvrit AngularJS alors que c’était un projet en version beta chez Google, encore totalement inconnu. Mais étant très attaché aux bonnes pratiques d’architecture et de développement, il ne pouvait qu’être séduit par le potentiel du framework et son apport considérable au développement d’applications web. Persuadé qu’il s’agit d’une révolution majeure dans le secteur, Thierry contribue depuis deux ans à faire connaître AngularJS par de nombreuses conférences, grâce au blog technique [FrAngular](http://www.frangular.com/) et à la communauté [AngularJS France](https://plus.google.com/communities/109984348857296908402) sur Google+. Et son activité professionnelle alterne entre les [formations à AngularJS](http://www.methotic.com/formation-angularjs), les audits d’applications en cours de développement, et le conseil sur leur architecture et les bonnes pratiques à mettre en oeuvre.",
        "twitter": "ThierryChatel",
        "github": "tchatel"
    },
    {
        "id": 13,
        "name": "Eric Hébert",
        "avatar": "images/speakers/Eric_Hebert.jpg",
        "resume": "JavaEE Architect chez Logica-CGI et scrum master, Eric mène des projets à fortes technologies en démarche agile le plus possible. Actuellement 'Software Factory Manager' du socle IHM HTML5 pour NICE du Crédit Agricole à Nantes, il travaille avec une équipe distribuée de 35 développeurs, 5 managers, 6 sites géographiques, 1 équipe locale de 15 personnes pour produire toutes les 3 semaines une release pour 4 plate-formes différentes. Basé sur maven avec plus de 150 plugins Maven et toutes les technos HTML5 du moment, cela occupe bien ses journées...",
        "twitter": "ehebert35"
    },
    {
        "id": 14,
        "name": "Thierry Leriche",
        "avatar": "images/speakers/Thierry_Leriche.jpg",
        "resume": "Thierry est consultant freelance (www.icauda.com) avec une douzaine d'années d'expérience. Il intervient principalement sur des projets Web (JEE) sur de l’architecture et/ou du développement.Il s’investi dans la formation des plus jeunes mais aussi de mes collègues et amis. Il est d’ailleurs professeur de Génie Logiciel à l'ESIEA et coach sur des projets de formation humaine. Quand il a un peu de temps, entre deux biberons, il est aussi rédacteur pour developpez.com",
        "twitter": "thierryleriche"
    },
    {
        "id": 15,
        "name": "Yoann Dubreuil",
	    "avatar": "images/speakers/Yoann_Dubreuil.jpg",
        "resume": "",
        "twitter": "YoannDubreuil"
    },
    {
        "id": 16,
        "name": "Julien Dubois",
	    "avatar": "images/speakers/Julien_Dubois.jpg",
        "resume": "Julien Dubois est directeur de l'innovation chez Ippon Technologies, société spécialisée dans le développement et l’architecture d’applications Java. Il y travaille sur les dernières tendances technologiques, afin de proposer à ses clients les projets les plus novateurs. Julien est connu dans le monde Java pour avoir co-écrit le livre \"Spring par la pratique\", avoir dirigé la filiale française de SpringSource, et plus récemment pour avoir lancé JHipster, le n°1 des générateurs d'applications Spring Boot + AngularJS.",
        "twitter": "juliendubois"
    },
    {
        "id": 17,
        "name": "Stéphane Épardaud",
	    "avatar": "images/speakers/Stephane_Epardaud.jpg",
        "resume": "Depuis les hautes montagnes de Nice, Stéphane travaille pour Red Hat sur le project Ceylon.Hacker passionné de Java, C, Perl ou Scheme. Versé dans les standards web et des bases de données, il a travaillé sur divers projets tel qu’un éditeur XML WYSIWYG, une libraire de multi-threading en C, un langage pour agents mobiles en Scheme (compilateur et machines virtuelles), ainsi que des services web 2.0 RESTful et des interfaces web riches en HTML 5 / Javascript.<br/>Avide de partage de connaissance, il va souvent parler dans des conférences tels que Scheme Workshop 2004, l´IUT de Nice en 2008, Polytech’Nice en 2009, le Mars JUG, le Paris JUG et le Riviera Java User Group qu’il a crée avec Nicolas Leroux. Acteur passionné de l´open source depuis le début, il contribute au projet RESTEasy et crée les projets jax-doclets, stamps.js, quelques modules de Play! Framework et travaille sur les projets Ceylon pour Red Hat.",
        "twitter": "UnFroMage"
    },
    {
        "id": 18,
        "name": "David Festal",
	    "avatar": "images/speakers/David_Festal.jpg",
        "resume": "Après quelques années de C, C++, et autres, David développe en Java depuis l’an 2000, dans des domaines variés tels que les environnements distribués, l’intégration de systèmes, l’analyse et la transformation de langages.<br/>Dans le cadre de SERLI, la SSII où il travaille depuis 15 ans, il a été impliqué dans plusieurs projets OpenSource, parmi lesquels on trouve Sonar, et plus récemment Ceylon.<br/>Affecté à plein temps sur le projet Ceylon par SERLI pendant plusieurs mois, il a principalement travaillé sur le plugin Eclipse pour Ceylon, en posant les bases de ce qui est devenu maintenant « Ceylon IDE ».",
        "twitter": "dfserli"
    },
    {
    	"id": 19,
    	"name":"Cédric Champeau",
    	"avatar":"images/speakers/Cedric_Champeau.jpg",
      "resume": "Cédric Champeau travaille chez Gradle Inc. sur l’outil de build open source éponyme. Il est en particulier intéressé par l’amélioration des performances et la modélisation. Cédric est aussi committer sur le langage Apache Groovy, qu’il a développé pendant plus de 3 ans au sein de Pivotal: créateur du compilateur statique, les traits, le support Android et autres fonctionnalités liées aux DSLs. Passionné par le métier, en particulier tout ce qui touche à l’outillage, Cédric aime avant tout développer des outils qui simplifient la vie des autres développeurs : langages, frameworks, build system, …",
    	"twitter":"CedricChampeau"
    },
    {
    	"id": 20,
    	"name":"Nicolas Ledez",
    	"avatar":"images/speakers/Nicolas_Ledez.jpg",
    	"resume":"Nicolas Ledez est architecte systéme chez Orange Business Services IT&L@bs. De formation industrielle puis informatique, il travaille dans l'IT depuis 12 ans. Il anime également Rennes On Rails, le forum Grafotech \"Cloud\", le groupe DevOps et Devcamp. Ses développements sont surtout réalisés pour automatiser les tâches rébarbatives. Il code en principalement Ruby. Vous pouvez également le retrouver sur son blog.",
    	"twitter":"nledez"
    },
    {
    	"id": 21,
    	"name":"Florian Douetteau",
    	"avatar":"images/speakers/Florian_Douetteau.jpg",
    	"resume":"Florian Douetteau est le président de Dataiku, éditeur français d'une plateforme de Data Science. Florian a participé au succès d’une des startups françaises phare des années 2000 : Exalead, leader français des technologies de moteur de recherche, jusqu'à la cession à Dassault Système en 2010 pour 135 M€. Florian a travaillé chez Exalead pendant 11 ans, donc 4 en tant que Directeur de la R&D avec des responsabilités telles que la définition de la stratégie produit, le pilotage d’une équipe de 55 ingénieurs R&D et la réalisation des versions successives du produit. Florian a plus récemment été Directeur Technique (CTO) d’une société de Social Gaming (IsCool Entertainement), et également Data Scientist Freelance chez Critéo.",
    	"twitter":"fdouetteau"
    },
    {
    	"id": 22,
    	"name":"Mathilde Lemée",
    	"avatar":"images/speakers/Mathilde_Lemee.jpg",
    	"resume":"Après des années en tant que freelance, Mathilde Lemée a rejoint Software AG (Terracota) en 2012 en tant qu’ingénieur Java R&D sur les sujets ehcache et bigmemory.\nElle a confondé les Duchess France pour connecter et rendre visible les femmes travaillant dans le monde Java, en 2012 elle a organisé de nombreux évènements (Hadoop, Mahout, Mockito, Cache …).\nElle blog sur [java-freelance.fr](http://www.java-freelance.fr) sur les performances, les meilleures pratiques et les tests. Elle contribue régulièrement à des projets open source et a créé FluentLenium, un surcouche de Selenium pour fournir une api fluide comme le font des projets comme Play!2. Elle intervient aussi régulièrement dans des conférences Java en Europe (Paris JUG, Devoxx France, Mix-it, Softshake) et édite un jeux mobile éducatif ([Aetys.fr](http://www.aetys.fr/)) pour IPad/iPhone et Android.",
    	"twitter":"MathildeLemee"
    },
    {
    	"id": 23,
    	"name":"David Pilato",
    	"avatar":"http://www.gravatar.com/avatar/20049a614b7f6838dc87b4bc39c42079.png",
    	"resume":"David Pilato est 'technical advocate' chez Elasticsearch.com, après avoir passé les deux années précédentes à promouvoir le projet open-source Elasticsearch, dont il anime la communauté française. Fidèle des JUG, il a donné une conférence sur le sujet lors de la première édition de Devoxx France en avril 2012 et sillonne désormais les routes de France pour partager sa passion.\nIl a implémenté un certain nombre de plugins pour l'écosystème Elasticsearch (Rivers RSS, FileSystem et DropBox, Factories Spring).\n\nIl a également implémenté Elasticsearch pour plusieurs projets, dont une importante administration française. Il est le co-auteur du projet open-source [Scrutmydocs.org](http://www.scrutmydocs.org/) basé sur Elasticsearch qui permet de disposer d'un moteur de recherche 'à la google' des documents de vos disques durs.",
    	"twitter":"dadoonet"
    },
    {
    	"id": 24,
    	"name":"David Gageot",
    	"avatar":"http://retour1024.fr/assets/img/hw_profile15_logo.jpg",
    	"resume":"Bonjour, je suis David Gageot, développeur indépendant. Ma passion ? L'écriture de logiciels pointus mais simples. J'ai pour leitmotiv d'être un facilitateur qui, par ma créativité et mon expertise, aide les équipes à être plus innovantes et plus efficaces.\nJe participe à des projets Java depuis 1998, comme responsable R&D chez l'éditeur Adesoft puis directeur technique chez Valtech Technology, CTO chez Algodeal, un fond d'investissement quantitatif puis développeur chez SonarSource, la société derrière Sonar.\nVous suivez peut-être mon blog [JavaBien!](http://blog.javabien.net/) depuis 2004..",
    	"twitter":"dgageot"
    },
    {
    	"id": 25,
    	"name":"Jean-Laurent de Morlhon",
    	"avatar":"http://morlhon.net/img/jl_400x492.png",
    	"resume":"Programmeur Freelance, co-createur de CodeStory, CTO de Serpodile. #craftsmanship #testing #coffeescript",
    	"twitter":"morlhon"
    },
    {
    	"id": 26,
    	"name":"David Morin",
    	"avatar":"images/speakers/David_Morin.jpg",
    	"resume":"Développeur Java avant tout, David s'intéresse à tout ce qui tourne autour de la JVM avec un vif intérêt pour les aspects performance et scalabilité. Il découvre Hadoop en 2011 et se passionne pour son écosystème dynamique. David travaille pour Cityzen Data, une start-up fournissant une plateforme scalable, sécurisée et éthique pour les données de capteurs.",
    	"twitter":"davAtBzh"
    },
    {
        "id": 27,
        "name":"Damien Cavaillès",
        "avatar":"images/speakers/Damien_Cavailles.jpg",
        "resume":"Développeur passionné par l'entreprenariat, Damien s'occupe du mobile chez TripnDrive. Il est aussi organisateur et facilitateur de Startup Weekend, en particulier sur la verticale Makers !",
        "twitter":"TheDamfr"
    },
    {
    	"id":28,
    	"name":"Duy Hai Doan",
    	"avatar":"http://www.gravatar.com/avatar/ffa96040bb4211cad1c66f385d8cb77b?size=320",
    	"resume":"DuyHai Doan est évangéliste technique pour Datastax, l’entreprise commerciale derrière Apache Cassandra.\nIl partage son temps entre donner des présentations/meetups/talks sur Cassandra, développer sur des projets open-source pour la communauté et aider les projets utilisant Cassandra.\nAvant Datastax, Duy Hai a été développeur freelance Java/Cassandra",
    	"twitter":"doanduyhai"
    },
    {
    	"id":29,
    	"name":"Amira LAKHAL",
    	"avatar":"http://www.duchess-france.org/wp-content/uploads/2012/11/049d377466738d7fff90a23581e0f85d.jpeg",
    	"resume":"Amira LAKHAL est Agile Java Scala développeur chez Valtech.\nElle est passionnée par l’agilité et les langages fonctionnels.\nElle est membre des Duchess France.",
    	"twitter":"Miralak"
    },
    {
    	"id":30,
    	"name":"Quentin ADAM",
    	"avatar":"https://pbs.twimg.com/profile_images/2019491025/IMG_0759s_400x400.jpg",
    	"resume":"Quentin ADAM is the CEO of Clever Cloud : a Platform as a Service company allowing you to run java, scala, ruby, node.js, php, python or go applications, with auto scaling and auto healing features. This position allow him to study lots of applications, code, practice, and extract some talks and advises. Regular speaker at various tech conference, he’s focused to help developers to deliver quickly and happily good applications.",
    	"twitter":"waxzce"
    },
    {
    	"id":31,
    	"name":"Horacio Gonzalez",
    	"avatar":"https://lh4.googleusercontent.com/-6krIgoWnkGk/AAAAAAAAAAI/AAAAAAAAAAA/6leVZjtmcrg/s128-c-k/photo.jpg",
    	"resume":"Spaniard lost in Brittany, unconformist coder, Java craftsman, dreamer and all-around geek. Works at @CityzenData. Founder & leader of @FinistJUG & @FinistGDG",
    	"twitter":"lostinbrittany"
    },
    {
    	"id":32,
    	"name":"Clément Delafargue",
    	"avatar":"http://penazen-consulting.com/images/clement_delafargue.jpg",
    	"resume":"Clément Delafargue est consultant indépendant. Diplômé de l’École Centrale de Nantes, il travaille dans le web depuis 2002. Il intervient à la fois sur les problématiques frontend et backend, sur de nombreuses technologies (Javascript (client et server-side), Ruby, Java, Scala) avec une attention particulière à la programmation fonctionnelle. ",
    	"twitter":"clementd"
    },
    {
    	"id":33,
    	"name":"Sami Jaber",
    	"avatar":"https://lh3.googleusercontent.com/-RcWq4LbM8NA/AAAAAAAAAAI/AAAAAAAAC7Y/LUh91Pp8_PQ/photo.jpg",
    	"resume":"Fondateur de DNG Consulting, formateur et consultant expert JEE et .NET. Auteur de Programmation GWT 2.",
    	"twitter":"samijaber"
    },
    {
    	"id":34,
    	"name":"François Sarradin",
    	"avatar":"https://pbs.twimg.com/profile_images/594904959071694848/jF340Hcf_400x400.jpg",
	"resume":"Manager technique capitalisation chez Ippon Technologies, je suis passionné par tout ce qui touche de près ou de loin au développement (craftsmanship, agilité, big data, devops) et en particulier à la programmation fonctionnelle. Je m’occupe aussi du site http://www.brownbaglunch.fr/.",
	"twitter":"fsarradin"

    },
    {
        "id":35,
        "name":"Grégory Le Bonniec",
        "avatar":"images/speakers/Gregory_Le_Bonniec.jpg",
        "resume":"Grégory Le Bonniec est consultant Java et co-créateur de la société [Ellixo](http://www.ellixo.com) basée à Rennes. Son parcours professionnel l'a amené à travailler pour de nombreux secteurs métiers avec l'écosystème Java comme dénominateur commun ; depuis plusieurs annnées, avec notamment sa découverte des architectures SOA, il s'est concentré sur les briques backend. Cela l'a amené tout naturellement à s'intéresser aujourd'hui aux architectures Microservices et Spring Boot en particulier.",
        "twitter":"greg_le_bonniec"
    },
    {
        "id":36,
        "name":"Youen Chene",
        "avatar":"images/speakers/Youen_Chene_200x200.jpg",
        "resume":"Passionné d’informatique et de programmation depuis le CE2 (génération MO5/TO7), Youen est un des activistes au sein du Normandy JUG (@normandyjug), Devoxx4Kids et Codeurs en Seine (@codeursenseine).<br/>Après 7 ans de prestation et de consulting en région parisienne, il est passé développeur-manager chez Masternaut puis maintenant CTO chez [Creative Data](http://www.creativedata.fr/) (où est développée [Saagie, la plateforme data prête à l’emploi](http://www.saagie.com/)).<br/>Blog : http://www.youenchene.fr",
        "twitter":"youen_chene"
    },
    {
        "id":37,
        "name":"Marc Audefroy",
        "avatar":"images/speakers/Marc_Audefroy.png",
        "resume":"Marc est un développeur passionné depuis son tout jeune âge. Il a travaillé pendant 2 ans en tant que développeur iOS à Niji et est aujourd'hui DevOps à OVH.  Sa passion ne se limite pas aux langages, elle s'exprime également aux travers des communautés techniques Rennaises. Vous le trouverez sans doute aux CocoaHeads, MUGOuest, Devcamp (Co-fondateur), DeVinciCode (Co-fondateur), RennesJS ou plus récemment Golang Rennes (Fondateur).",
        "twitter":"MarcAudefroy"
    },
    {
        "id":38,
        "name":"Clément Escoffier",
        "avatar":"images/speakers/ClementEscoffier.jpg",
        "resume":"Qui suis-je ? Bonne question. J'ai été chercheur à l’université de Grenoble, architecte chez Axway, directeur de l'innovation dans une boite allemande.... Actuellement je suis core developer sur Vert.x, et je travaille pour Red Hat. J’ai touché à beaucoup de domaines: OSGi, mobile, continuous delivery, devops, HTML5… Mon but ? Fournir des outils, des méthodes pour rendre le développement plus efficace mais également plus agréable et plus fun. Je suis un contributeur actif sur de nombreux projets Open Source comme Apache Felix, iPOJO, Wisdom Framework et bien évidement Vert.x.",
        "twitter":"clementplop"
    },
    {
        "id":39,
        "name":"Arnaud Bailly",
        "avatar":"http://www.gravatar.com/avatar/48469162d45686615c6bf0eb4304bf26",
        "resume":"Arnaud développe des logiciels à usage professionnel depuis 1994. Il s'intéresse particulièrement aux problèmes liés à la conception de systèmes logiciels complexes et répartis et aux langages fonctionnels.",
        "twitter":"abailly"
    },
    {
        "id":40,
        "name":"Cédric Pineau",
        "avatar":"",
        "resume":"Directeur de la technologie chez Taelys.\nEnthousiasmé par la programmation fonctionnelle, entravé par mon quotidien de javaiste, passionné par les réflexions autour des architectures logicielles, interpellé par la qualité de ce que l'on produit, intéressé par les questions de performance, amusé par les modes qui rythment notre métier..",
        "twitter":"CedricPineau"
    },
    {
        "id":41,
        "name":"Alexandre Thomazo",
        "avatar":"images/speakers/AlexThomazo.jpg",
        "resume":"Développeur Java chez Softeam le jour, je m'intéresse pour le reste à tout ce qui touche de près ou de loin à un ordinateur : développement, ops, réseau, IoT, domotique...<br>Passionné depuis mon plus jeune âge, je fais naturellement parti de l'équipe d'organisation du BreizhCamp ce qui me laisse encore moins de temps pour mes nombreux projets perso :D",
        "twitter":"alexlg"
    },
    {
        "id":42,
        "name":"Maxime Odye",
        "avatar":"images/speakers/MaximeOdye.jpg",
        "resume":"Maxime, consultant back-end chez Zenika Rennes. Passionné techniquement, j'aime découvrir et re-découvrir les différentes technologies gravitant autour de l'écosystème Java. Amateur des différentes communautés (Jug, BreizhCamp, AgileTour), j'estime que le partage technique, et non technique, dans le secteur de l'Informatique est quelque chose d'extraordinaire.<br> Découverte, progression et approfondissement, l'enrichissement personnel est grand et essentiel pour nous faire tous progresser. Je suis formateur ElasticSearch et ELK (ElasticSearch, Logstash, Kibana).",
        "twitter":"MaxOdye"
    },
    {
        "id":43,
        "name":"Jean-Pascal Thiery",
        "avatar":"images/speakers/JeanPascalThiery.jpg",
        "resume":"Java Craftsman et agiliste pratiquant. Jean-Pascal a arpenté les voies de l'intégration continue jusqu'à intégrer la mouvance DevOps. Il aime : Java, Docker, Mesos, et la qualité des livrables. Il n'aime pas : les phrases qui commence par \"Normalement, ...\".",
        "twitter":"jpthiery "
    },
    {
        "id":44,
        "name":"Antoine Le Taxin",
        "avatar":"images/speakers/AntoineLeTaxin.png",
        "resume":"Développeur fullstack, afición du javascript de la première heure, Antoine suit avec passion les évolutions de l’écosystème : de Backbone à React en passant par Angular et Node, bon nombre de frameworks JS lui sont passés sous les doigts.",
        "twitter":"ModuloM"
    },
    {
        "id":45,
        "name":"Gilles Di Guglielmo",
        "avatar":"images/speakers/GillesDiGuglielmo.jpg",
        "resume":"Gilles travaille depuis 15 ans pour différents éditeurs de logiciels (ILOG, PrimaSolution, Courtanet) sur des sujets très variés: librairie graphique 2D, moteur de règles, plate-forme de services, code génération de modèle métier. Actuellement, il est architecte pour le site LesFurets.com, et aime prendre l’air de temps en temps à San Francisco ou à Anvers. Il a présenté différentes sessions à JavaOne, Devoxx, SoftShake, CodeGeneration et plusieurs Java User Group en France.",
        "twitter":"gdigugli"
    },
    {
        "id":46,
        "name":"Ozan Gunalp",
        "avatar":"images/speakers/OzanGunalp.jpg",
        "resume":"Ingénieur docteur avec 5+ ans d'expérience dans les systèmes distribués, l'Internet des objets et les processus de développement logiciels. Chez LesFurets.com je m'intéresse à l'amélioration de la qualité et du pipeline de livraison de logiciel.",
        "twitter":"ozangunalp"
    },
    {
        "id":47,
        "name":"Laurent Doguin",
        "avatar":"images/speakers/laurentDoguin.png",
        "resume":"Laurent is a Paris based Developer Advocate where he focuses on helping Java developers and the French community. He writes code in Java and blog posts in Markdown. Prior to joining Couchbase he was Nuxeo’s community liaison where he devoted his time and expertise to helping the entire Nuxeo Community become more active and efficient.",
        "twitter":"ldoguin"
    },
    {
        "id":48,
        "name":"Philippe Charrière",
        "avatar":"images/speakers/k33g_org.jpg",
        "resume":"Mais qui est @k33g_org?<br/>Bon c’est pas simple à expliquer … Je voudrais dire que je suis un dev qui fait du commerce, ou un commercial qui fait du dev, mais ça passe mieux en anglais (tech evangelist with sales/post sales and pre sales skills) et en 🇫🇷 ça peut être mal interprété 😉 … “quoi un commercial dans un JUG! Mais de qui se moque-t-on!?”, donc dans la vie je suis:<br/>Eleveur de 🤖<br/>Golo tech-evangelist-dev-relation-advocate 😜 @TypeUnsafe<br/>Geek officiel d’entreprise<br/>IOT addict<br/>Consultant 😂<br/>@ScalaIO_FR member<br/>@MixIT_Lyon member<br/>Solutions engineer @GitHub<br/>Language agnostic … (à part le JavaScript)<br/>et certainement d’autres trucs mais bon …",
        "twitter":"k33g_org"
    },
    {
        "id":49,
        "name":"Lucas Pouzac",
        "avatar":"images/speakers/lucasPouzac.png",
        "resume":"Après plusieurs années de développement en SSII, j'ai rejoins PagesJaunes en tant qu'architecte technique. L'optimisation des performances serveurs du site web / mobile, la gestion de l'obsolescence de nos frameworks et l'évolution de nos plateformes et middlewares font partie de mon quotidien.",
        "twitter":"_LouKs_"
    },
    {
        "id":50,
        "name":"David De Carvalho",
        "avatar":"images/speakers/david-decarvalho.jpg",
        "resume":"Je travaille actuellement chez Pagesjaunes (7 ans). Je suis Technical Leader et Ingénieur Développeur \"touche-à-tout\" depuis une dizaine d'années (13 ans). Mon langage de prédilection est le Java (entre autres) mais je travaille également sur des sujets techniques, allant des Bases de données aux API REST en passant par la mise en place d'outillage interne. Je suis également friand de tout ce qui concerne les process Agile, j'ai d'ailleurs été ScrumMaster pendant 2 avant de revenir à la technique pure.",
        "twitter":"dedece35"
    },
    {
        "id":51,
        "name":"Florent Biville",
        "avatar":"images/speakers/fbiville.jpg",
        "resume":"Señor software engineer at Pivotal Labs, ex-Criteo, Spring Meetup & Papers We Love Paris co-founder, Hackergarten org and F/OSS lover, Florent Biville strives for producing simple and robust software within great teams.<br>Involved for several years with Neo4j, Florent is an official Neo4j Ambassador and an independent trainer.<br>He also enjoys giving back the time he borrowed while using F/OSS software by contributing patches and sometimes whole new projects such as Liquigraph.<br>Blog: http://fbiville.github.io",
        "twitter":"fbiville"
    },
    {
        "id":52,
        "name":"Marouane Gazanayi",
        "avatar":"images/speakers/mgazanayi.jpg",
        "resume":"Marouane is a passionate developer and a continous learner. He attends as many conferences as he can and follow some MOOCs to always be up to date.<br>He likes working(and is working) with great people that can push him to the top.<br>He likes agility and want to be a software craftsman.",
        "twitter":"mgazanayi"
    }
]
